<template>
  <p>
    组件：特别封装（html结构、CSS样式、JS交互代码）小零件内！
          变量局部作用域，相互之间不污染！
          style: scoped 样式私有化


    组件通信：
         父给子：（形参实参！）
            子组件：特别的函数封装，内部需要设置形参，使用形参！props
                   props：严格设置（类型、是否必传、默认值？自定义验证？）
            父组件：在调用子组件的时候，传入实参！:形参名="实参的变量"
                   传入一个对象：地址！（有利于后续开发！）

         子给父：（收发信号！）
            子组件：需要给父级发送信号  this.$emit("自定义事件名称",...发送数据)
            父组件：在调用子组件的时候，接受信号 @自定义事件名称="执行函数名"
                    执行函数名(形参...){ 接受到子组件给传递数据}
    
    作业：
       1、todos
       2、筛选功能研究
       3、小狗作业！
  </p>
</template>

<script>
export default {

}
</script>

<style>

</style>